231n.org
#+TITLE: Note of cs231n
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="org.css" />
#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t

#+TOC: headlines 2

* Classification
L1 distance: $d_1 (I_1, I_2) = \sum_{p} \left| I^p_1 - I^p_2 \right|$

L2 distance: $d_2 (I_1, I_2) = \sqrt{\sum_{p} \left( I^p_1 - I^p_2 \right)^2}$

k-Nearest Neighbor (kNN) classifier

[[http://homepage.tudelft.nl/19j49/t-SNE.html][t-SNE]]

If your data is very high-dimensional, consider using a dimensionality reduction technique
such as PCA ([[https://www.wikiwand.com/en/Principal_component_analysis][wiki ref]], [[http://cs229.stanford.edu/notes/cs229-notes10.pdf][CS229ref]], [[http://cs229.stanford.edu/notes/cs229-notes10.pdf][blog ref]]) or even [[http://scikit-learn.org/stable/modules/random_projection.html][Random Projections]].

If your kNN classifier is running too long, consider using an Approximate Nearest Neighbor library
(e.g. [[http://www.cs.ubc.ca/research/flann/][FLANN]]) to accelerate the retrieval (at cost of some accuracy).

Ref:

[[http://homes.cs.washington.edu/~pedrod/papers/cacm12.pdf][A Few Useful Things to Know about Machine Learning]]

[[http://people.csail.mit.edu/torralba/shortCourseRLOC/index.html][Recognizing and Learning Object Categories]], ICCV 2005


* Linear Cliassify

Linear classifier:

\[f(x_i, W, b) =  W x_i + b\]

** Multiclass Support Vector Machine

the score for the j-th class is the j-th element:

\[s_j=f(x_i,W)_j\]

loss for the i-th example:

\[L_i = \sum_{j\neq y_i} \max(0, s_j - s_{y_i} + \Delta)\]

vectorlize:

\[f(x_i; W) =  W x_i\]

\[L_i = \sum_{j\neq y_i} \max(0, w_j^T x_i - w_{y_i}^T x_i + \Delta)\]


In summary, the SVM loss function wants the score of the correct class
$y_i$ to be larger than the incorrect class scores by at least by $\Delta$.

The setting of $\Delta$ (1.0 is fine) is in some sense meaningless because the weights can shrink.

The threshold at zero $max(0,-)$ function is often called the *hinge loss*.

** Softmax classifier

generalization of binary Logistic Regression classifier to multiple classes

output normalized class probabilities and also has a probabilistic interpretation

cross-entropy loss:

\[L_i = -\log\left(\frac{e^{f_{y_i}}}{ \sum_j e^{f_j} }\right) \hspace{0.1in} \text{or equivalently} \hspace{0.1in} L_i = -f_{y_i} + \log\sum_j e^{f_j}\]

$f_i$ is the i-th element of the vector of class scores $f$

softmax function:

\[f_j(z) = \frac{e^{z_j}}{\sum_k e^{z_k}}\]

Maximum Likelihood Estimation (MLE)

Maximum a posteriori (MAP) (Gaussian prior?)

The SVM classifier uses the hinge loss, or also sometimes called the max-margin loss. The Softmax classifier uses the cross-entropy loss.

ref:
[[http://arxiv.org/abs/1306.0239][Deep Learning using Linear Support Vector Machines]]


* Optimization

Gradient Descent

backpropagation


* Neural Networks

** Activation functions

sigmoid: \[\sigma(x) = 1/(1+e^{-x})\]

- (-) Sigmoids saturate and kill gradients.
- (-) Sigmoid outputs are not zero-centered.

tanh non-linearity is always preferred to the sigmoid nonlinearity.

ReLU: \[f(x) = \max(0, x)\]

- (+) Simple and fast.
- (-) Can be fragile during training and can “die”.

Leaky ReLU : \[f(x) = \mathbb{1} (x < 0) (\alpha x) + \mathbb{1} (x>=0) (x)\]

-  [[http://arxiv.org/abs/1502.01852][Delving Deep into Rectifiers]], Kaiming He et al., 2015
- attempt to fix the “dying ReLU” problem

Maxout: \[\max(w_1^Tx+b_1, w_2^Tx + b_2)\]

- by [[http://www-etud.iro.umontreal.ca/~goodfeli/maxout.html][Goodfellow et al.]] that generalizes the ReLU and its leaky version
- (-) doubles the number of parameters

TLDR:
- *Use the ReLU non-linearity*, be careful with your learning rates and possibly monitor the fraction of “dead” units in a network.
- If this concerns you, give Leaky ReLU or Maxout a try.
- Never use sigmoid. Try tanh, but expect it to work worse than ReLU/Maxout.


** PCA

#+BEGIN_SRC python
# Assume input data matrix X of size [N x D]
X -= np.mean(X, axis = 0) # zero-center the data (important)
cov = np.dot(X.T, X) / X.shape[0] # get the data covariance matrix
U,S,V = np.linalg.svd(cov) #  SVD factorization
#+END_SRC

Columns of U are the eigenvectors and S is a 1-D array of the singular values
(which are equal to the eigenvalues squared).

projection and dimensionality reduction:
#+BEGIN_SRC python
Xrot = np.dot(X, U) # decorrelate the data
Xrot_reduced = np.dot(X, U[:,:100]) # Xrot_reduced becomes [N x 100]
#+END_SRC


** Whitening

The whitening operation takes the data in the eigenbasis and
divides every dimension by the eigenvalue to normalize the scale.

#+BEGIN_SRC python
Xwhite = Xrot / np.sqrt(S + 1e-5)
#+END_SRC


