231n.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-14 Wed 18:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Note of cs231n</title>
<meta name="author" content="scturtle" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Note of cs231n</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd77dfb9">1. Classification</a></li>
<li><a href="#org9fbe55f">2. Linear Cliassify</a>
<ul>
<li><a href="#org565df0a">2.1. Multiclass Support Vector Machine</a></li>
<li><a href="#org53133ed">2.2. Softmax classifier</a></li>
</ul>
</li>
<li><a href="#org6bc950e">3. Optimization</a></li>
<li><a href="#org3e40f40">4. Neural Networks</a>
<ul>
<li><a href="#org773a89e">4.1. Activation functions</a></li>
<li><a href="#org252212a">4.2. PCA</a></li>
<li><a href="#orgc965fe4">4.3. Whitening</a></li>
<li><a href="#orgc361d0e">4.4. Weight initialization</a></li>
<li><a href="#orge8666d8">4.5. Regularization</a></li>
<li><a href="#org5cb23c4">4.6. Loss functions</a></li>
<li><a href="#orga87bfdb">4.7. Summary</a></li>
<li><a href="#org21515e7">4.8. Gradient check</a></li>
<li><a href="#orgdc02ce4">4.9. Ratio of weights:updates</a></li>
<li><a href="#org26dc771">4.10. Parameter updates</a></li>
<li><a href="#org62d164c">4.11. Hyperparameter optimization</a></li>
<li><a href="#orge5293a9">4.12. Model Ensembles</a></li>
</ul>
</li>
<li><a href="#org8fbbd19">5. Convolutional Networks</a>
<ul>
<li><a href="#org24bdf97">5.1. The Conv Layer</a></li>
<li><a href="#org562640b">5.2. The Pooling Layer</a></li>
<li><a href="#orge0aa1b5">5.3. Normalization Layer</a></li>
<li><a href="#orgd78c819">5.4. FC-&gt;CONV conversion</a></li>
<li><a href="#org0006203">5.5. ConvNet Architectures</a></li>
<li><a href="#org9e47bba">5.6. Layer Sizing Patterns</a></li>
<li><a href="#org8110b4c">5.7. Case studies</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgd77dfb9" class="outline-2">
<h2 id="orgd77dfb9"><span class="section-number-2">1.</span> Classification</h2>
<div class="outline-text-2" id="text-1">
<p>
L1 distance: \(d_1 (I_1, I_2) = \sum_{p} \left| I^p_1 - I^p_2 \right|\)
</p>

<p>
L2 distance: \(d_2 (I_1, I_2) = \sqrt{\sum_{p} \left( I^p_1 - I^p_2 \right)^2}\)
</p>

<p>
k-Nearest Neighbor (kNN) classifier
</p>

<p>
<a href="http://homepage.tudelft.nl/19j49/t-SNE.html">t-SNE</a>
</p>

<p>
If your data is very high-dimensional, consider using a dimensionality reduction technique
such as PCA (<a href="https://www.wikiwand.com/en/Principal_component_analysis">wiki ref</a>, <a href="http://cs229.stanford.edu/notes/cs229-notes10.pdf">CS229ref</a>, <a href="http://cs229.stanford.edu/notes/cs229-notes10.pdf">blog ref</a>) or even <a href="http://scikit-learn.org/stable/modules/random_projection.html">Random Projections</a>.
</p>

<p>
If your kNN classifier is running too long, consider using an Approximate Nearest Neighbor library
(e.g. <a href="http://www.cs.ubc.ca/research/flann/">FLANN</a>) to accelerate the retrieval (at cost of some accuracy).
</p>

<p>
Ref:
</p>

<p>
<a href="http://homes.cs.washington.edu/~pedrod/papers/cacm12.pdf">A Few Useful Things to Know about Machine Learning</a>
</p>

<p>
<a href="http://people.csail.mit.edu/torralba/shortCourseRLOC/index.html">Recognizing and Learning Object Categories</a>, ICCV 2005
</p>
</div>
</div>


<div id="outline-container-org9fbe55f" class="outline-2">
<h2 id="org9fbe55f"><span class="section-number-2">2.</span> Linear Cliassify</h2>
<div class="outline-text-2" id="text-2">
<p>
Linear classifier:
</p>

<p>
\[f(x_i, W, b) =  W x_i + b\]
</p>
</div>

<div id="outline-container-org565df0a" class="outline-3">
<h3 id="org565df0a"><span class="section-number-3">2.1.</span> Multiclass Support Vector Machine</h3>
<div class="outline-text-3" id="text-2-1">
<p>
the score for the j-th class is the j-th element:
</p>

<p>
\[s_j=f(x_i,W)_j\]
</p>

<p>
loss for the i-th example:
</p>

<p>
\[L_i = \sum_{j\neq y_i} \max(0, s_j - s_{y_i} + \Delta)\]
</p>

<p>
vectorlize:
</p>

<p>
\[f(x_i; W) =  W x_i\]
</p>

<p>
\[L_i = \sum_{j\neq y_i} \max(0, w_j^T x_i - w_{y_i}^T x_i + \Delta)\]
</p>


<p>
In summary, the SVM loss function wants the score of the correct class
\(y_i\) to be larger than the incorrect class scores by at least by \(\Delta\).
</p>

<p>
The setting of \(\Delta\) (1.0 is fine) is in some sense meaningless because the weights can shrink.
</p>

<p>
The threshold at zero \(max(0,-)\) function is often called the <b>hinge loss</b>.
</p>
</div>
</div>

<div id="outline-container-org53133ed" class="outline-3">
<h3 id="org53133ed"><span class="section-number-3">2.2.</span> Softmax classifier</h3>
<div class="outline-text-3" id="text-2-2">
<p>
generalization of binary Logistic Regression classifier to multiple classes
</p>

<p>
output normalized class probabilities and also has a probabilistic interpretation
</p>

<p>
cross-entropy loss:
</p>

<p>
\[L_i = -\log\left(\frac{e^{f_{y_i}}}{ \sum_j e^{f_j} }\right) \hspace{0.1in} \text{or equivalently} \hspace{0.1in} L_i = -f_{y_i} + \log\sum_j e^{f_j}\]
</p>

<p>
\(f_i\) is the i-th element of the vector of class scores \(f\)
</p>

<p>
softmax function:
</p>

<p>
\[f_j(z) = \frac{e^{z_j}}{\sum_k e^{z_k}}\]
</p>

<p>
Maximum Likelihood Estimation (MLE)
</p>

<p>
Maximum a posteriori (MAP) (Gaussian prior?)
</p>

<p>
The SVM classifier uses the hinge loss, or also sometimes called the max-margin loss. The Softmax classifier uses the cross-entropy loss.
</p>

<p>
ref:
<a href="http://arxiv.org/abs/1306.0239">Deep Learning using Linear Support Vector Machines</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org6bc950e" class="outline-2">
<h2 id="org6bc950e"><span class="section-number-2">3.</span> Optimization</h2>
<div class="outline-text-2" id="text-3">
<p>
Gradient Descent
</p>

<p>
backpropagation
</p>
</div>
</div>


<div id="outline-container-org3e40f40" class="outline-2">
<h2 id="org3e40f40"><span class="section-number-2">4.</span> Neural Networks</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org773a89e" class="outline-3">
<h3 id="org773a89e"><span class="section-number-3">4.1.</span> Activation functions</h3>
<div class="outline-text-3" id="text-4-1">
<p>
sigmoid: \[\sigma(x) = 1/(1+e^{-x})\]
</p>

<ul class="org-ul">
<li>(-) Sigmoids saturate and kill gradients.</li>
<li>(-) Sigmoid outputs are not zero-centered.</li>
</ul>

<p>
tanh non-linearity is always preferred to the sigmoid nonlinearity.
</p>

<p>
ReLU: \[f(x) = \max(0, x)\]
</p>

<ul class="org-ul">
<li>(+) Simple and fast.</li>
<li>(-) Can be fragile during training and can “die”.</li>
</ul>

<p>
Leaky ReLU : \[f(x) = \mathbb{1} (x < 0) (\alpha x) + \mathbb{1} (x>=0) (x)\]
</p>

<ul class="org-ul">
<li><a href="http://arxiv.org/abs/1502.01852">Delving Deep into Rectifiers</a>, Kaiming He et al., 2015</li>
<li>attempt to fix the “dying ReLU” problem</li>
</ul>

<p>
Maxout: \[\max(w_1^Tx+b_1, w_2^Tx + b_2)\]
</p>

<ul class="org-ul">
<li>by <a href="http://www-etud.iro.umontreal.ca/~goodfeli/maxout.html">Goodfellow et al.</a> that generalizes the ReLU and its leaky version</li>
<li>(-) doubles the number of parameters</li>
</ul>

<p>
TLDR:
</p>
<ul class="org-ul">
<li><b>Use the ReLU non-linearity</b>, be careful with your learning rates and possibly monitor the fraction of “dead” units in a network.</li>
<li>If this concerns you, give Leaky ReLU or Maxout a try.</li>
<li>Never use sigmoid. Try tanh, but expect it to work worse than ReLU/Maxout.</li>
</ul>
</div>
</div>


<div id="outline-container-org252212a" class="outline-3">
<h3 id="org252212a"><span class="section-number-3">4.2.</span> PCA</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">Assume input data matrix X of size [N x D]</span>
<span style="color: #BA36A5;">X</span> -= np.mean(X, axis = 0) <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">zero-center the data (important)</span>
<span style="color: #BA36A5;">cov</span> = np.dot(X.T, X) / X.shape[0] <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">get the data covariance matrix</span>
<span style="color: #BA36A5;">U</span>,<span style="color: #BA36A5;">S</span>,<span style="color: #BA36A5;">V</span> = np.linalg.svd(cov) <span style="color: #8D8D84; font-style: italic;">#  </span><span style="color: #8D8D84; font-style: italic;">SVD factorization</span>
</pre>
</div>

<p>
Columns of U are the eigenvectors and S is a 1-D array of the singular values
(which are equal to the eigenvalues squared).
</p>

<p>
projection and dimensionality reduction:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">Xrot</span> = np.dot(X, U) <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">decorrelate the data</span>
<span style="color: #BA36A5;">Xrot_reduced</span> = np.dot(X, U[:,:100]) <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">Xrot_reduced becomes [N x 100]</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc965fe4" class="outline-3">
<h3 id="orgc965fe4"><span class="section-number-3">4.3.</span> Whitening</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The whitening operation takes the data in the eigenbasis and
divides every dimension by the eigenvalue to normalize the scale.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">Xwhite</span> = Xrot / np.sqrt(S + 1e-5)
</pre>
</div>
</div>
</div>
