231n.org
** Weight initialization

The recommended heuristic is to initialize each neuron’s weight vector as:
~w = np.random.randn(n) / sqrt(n)~, where n is the number of its inputs.

Another choice: $\text{Var}(w) = 2/(n_{in} + n_{out})$.

[[http://arxiv-web3.library.cornell.edu/abs/1502.01852][Recommend]]: ReLU unit and ~w = np.random.randn(n) * sqrt(2.0/n)~.

[[http://arxiv.org/abs/1502.03167][Batch Normalization]]: explicitly forcing the activations throughout a network
to take on a unit gaussian distribution at the beginning of the training.
Insert the BatchNorm layer immediately after fully connected layers
(or convolutional layers), and before non-linearities.


** Regularization

*L2 regularization* encouraging the network to use all of its inputs a little
rather that some of its inputs a lot.

*L1 regularization* leads the weight vectors to become sparse during optimization
 (i.e. very close to exactly zero).
Neurons end up using only a sparse subset of their most important inputs and
 become nearly invariant to the “noisy” inputs.

*Max norm constraints* enforce an absolute upper bound on the magnitude
 of the weight vector. $\Vert \vec{w} \Vert_2 < c$, c are on orders of 3 or 4.

[[http://www.cs.toronto.edu/~rsalakhu/papers/srivastava14a.pdf][Dropout]] is implemented by only keeping a neuron active with some probability
 $p$ (a hyperparameter), or setting it to zero otherwise.
In the predict function we are not dropping anymore but performing a scaling.
inverted dropout performs the scaling at train time,
 leaving the forward pass at test time untouched.

*In practice*: It is most common to use a single, global L2 regularization strength
that is cross-validated.
It is also common to combine this with dropout applied after all layers.
The value of p=0.5.


** Loss functions

*** Classification

SVM:

\[L_i = \sum_{j\neq y_i} \max(0, f_j - f_{y_i} + 1)\]

Softmax classifier uses the cross-entropy loss:

\[L_i = -\log\left(\frac{e^{f_{y_i}}}{ \sum_j e^{f_j} }\right)\]

[[http://arxiv.org/pdf/1310.4546.pdf][Hierarchical Softmax]]


*** Attribute/Multiclass classification

Binary classifier for each class:

\[L_i = \sum_j \max(0, 1 - y_{ij} f_j)\]

Logistic regression classifier for every class
 and probability for class 1 is:

\[P(y = 1 \mid x; w, b) = \frac{1}{1 + e^{-(w^Tx +b)}} = \sigma (w^Tx + b)\]

The loss function then maximizes the log likelihood of this probability:

\[L_i = \sum_j y_{ij} \log(\sigma(f_j)) + (1 - y_{ij}) \log(1 - \sigma(f_j))\]

Gradient on $f$:

\[\partial{L_i} / \partial{f_j} = y_{ij} - \sigma(f_j)\]


*** Regression

L2/L1.

Word of caution:

1. It is important to note that the L2 loss is much harder
 to optimize than a more stable loss such as Softmax.

2. Additionally, the L2 loss is less robust because
 outliers can introduce huge gradients.

3. When faced with a regression problem, first consider if it
 is absolutely inadequate to quantize the output into bins.

4. the L2 is more fragile and applying dropout in the network
 (especially in the layer right before the L2 loss) is not a great idea.

#+BEGIN_QUOTE
 When faced with a regression task, first consider if it is absolutely necessary.
 Instead, have a strong preference to discretizing your outputs to bins and
 perform classification over them whenever possible.
#+END_QUOTE


*** Structured prediction

The basic idea behind the structured SVM loss is to demand a margin
 between the correct structure $y_i$ and the highest-scoring incorrect structure.


** Summary

1. The recommended preprocessing is to center the data to have mean of zero,
 and normalize its scale to [-1, 1] along each feature.

2. Initialize the weights by drawing them from a gaussian distribution
 with standard deviation of $\sqrt{2/n}$, where $n$ is the number of inputs to the neuron.
 E.g. in numpy: ~w = np.random.randn(n) * sqrt(2.0/n)~.

3. Use L2 regularization and dropout (the inverted version).

4. Use batch normalization.


** Gradient check

\[\frac{df(x)}{dx} = \frac{f(x + h) - f(x - h)}{2h}\]

\[\frac{\mid f'_a - f'_n \mid}{\max(\mid f'_a \mid, \mid f'_n \mid)}\]

[[http://docs.oracle.com/cd/E19957-01/806-3568/ncg_goldberg.html][“What Every Computer Scientist Should Know About Floating-Point Arithmetic”]]


*Kinks* refer to non-differentiable parts of an objective function.

It is best to use a short burn-in time during which the network is allowed to
 learn and perform the gradient check after the loss starts to go down.

It is recommended to turn off regularization and check the data loss alone first,
 and then the regularization term second and independently.

Remember to turn off any non-deterministic effects in the network,
 such as dropout, random data augmentations, etc.


** Ratio of weights:updates

#+BEGIN_SRC python
# assume parameter vector W and its gradient vector dW
param_scale = np.linalg.norm(W.ravel())
update = -learning_rate*dW # simple SGD update
update_scale = np.linalg.norm(update.ravel())
W += update # the actual update
print update_scale / param_scale # want ~1e-3
#+END_SRC


** Parameter updates

*** Momentum update

#+BEGIN_SRC python
v = mu * v - learning_rate * dx # integrate velocity
x += v # integrate position
#+END_SRC

A typical setting is to start with momentum of about 0.5 and
 anneal it to 0.99 or so over multiple epochs.


