231n.html


<div id="outline-container-orgc361d0e" class="outline-3">
<h3 id="orgc361d0e"><span class="section-number-3">4.4.</span> Weight initialization</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The recommended heuristic is to initialize each neuron’s weight vector as:
<code>w = np.random.randn(n) / sqrt(n)</code>, where n is the number of its inputs.
</p>

<p>
Another choice: \(\text{Var}(w) = 2/(n_{in} + n_{out})\).
</p>

<p>
<a href="http://arxiv-web3.library.cornell.edu/abs/1502.01852">Recommend</a>: ReLU unit and <code>w = np.random.randn(n) * sqrt(2.0/n)</code>.
</p>

<p>
<a href="http://arxiv.org/abs/1502.03167">Batch Normalization</a>: explicitly forcing the activations throughout a network
to take on a unit gaussian distribution at the beginning of the training.
Insert the BatchNorm layer immediately after fully connected layers
(or convolutional layers), and before non-linearities.
</p>
</div>
</div>


<div id="outline-container-orge8666d8" class="outline-3">
<h3 id="orge8666d8"><span class="section-number-3">4.5.</span> Regularization</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<b>L2 regularization</b> encouraging the network to use all of its inputs a little
rather that some of its inputs a lot.
</p>

<p>
<b>L1 regularization</b> leads the weight vectors to become sparse during optimization
 (i.e. very close to exactly zero).
Neurons end up using only a sparse subset of their most important inputs and
 become nearly invariant to the “noisy” inputs.
</p>

<p>
<b>Max norm constraints</b> enforce an absolute upper bound on the magnitude
 of the weight vector. \(\Vert \vec{w} \Vert_2 < c\), c are on orders of 3 or 4.
</p>

<p>
<a href="http://www.cs.toronto.edu/~rsalakhu/papers/srivastava14a.pdf">Dropout</a> is implemented by only keeping a neuron active with some probability
 \(p\) (a hyperparameter), or setting it to zero otherwise.
In the predict function we are not dropping anymore but performing a scaling.
inverted dropout performs the scaling at train time,
 leaving the forward pass at test time untouched.
</p>

<p>
<b>In practice</b>: It is most common to use a single, global L2 regularization strength
that is cross-validated.
It is also common to combine this with dropout applied after all layers.
The value of p=0.5.
</p>
</div>
</div>


<div id="outline-container-org5cb23c4" class="outline-3">
<h3 id="org5cb23c4"><span class="section-number-3">4.6.</span> Loss functions</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-org9b0e61e" class="outline-4">
<h4 id="org9b0e61e"><span class="section-number-4">4.6.1.</span> Classification</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
SVM:
</p>

<p>
\[L_i = \sum_{j\neq y_i} \max(0, f_j - f_{y_i} + 1)\]
</p>

<p>
Softmax classifier uses the cross-entropy loss:
</p>

<p>
\[L_i = -\log\left(\frac{e^{f_{y_i}}}{ \sum_j e^{f_j} }\right)\]
</p>

<p>
<a href="http://arxiv.org/pdf/1310.4546.pdf">Hierarchical Softmax</a>
</p>
</div>
</div>


<div id="outline-container-org07cbc6a" class="outline-4">
<h4 id="org07cbc6a"><span class="section-number-4">4.6.2.</span> Attribute/Multiclass classification</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
Binary classifier for each class:
</p>

<p>
\[L_i = \sum_j \max(0, 1 - y_{ij} f_j)\]
</p>

<p>
Logistic regression classifier for every class
 and probability for class 1 is:
</p>

<p>
\[P(y = 1 \mid x; w, b) = \frac{1}{1 + e^{-(w^Tx +b)}} = \sigma (w^Tx + b)\]
</p>

<p>
The loss function then maximizes the log likelihood of this probability:
</p>

<p>
\[L_i = \sum_j y_{ij} \log(\sigma(f_j)) + (1 - y_{ij}) \log(1 - \sigma(f_j))\]
</p>

<p>
Gradient on \(f\):
</p>

<p>
\[\partial{L_i} / \partial{f_j} = y_{ij} - \sigma(f_j)\]
</p>
</div>
</div>


<div id="outline-container-orge1c4e0b" class="outline-4">
<h4 id="orge1c4e0b"><span class="section-number-4">4.6.3.</span> Regression</h4>
<div class="outline-text-4" id="text-4-6-3">
<p>
L2/L1.
</p>

<p>
Word of caution:
</p>

<ol class="org-ol">
<li>It is important to note that the L2 loss is much harder
to optimize than a more stable loss such as Softmax.</li>

<li>Additionally, the L2 loss is less robust because
outliers can introduce huge gradients.</li>

<li>When faced with a regression problem, first consider if it
is absolutely inadequate to quantize the output into bins.</li>

<li>the L2 is more fragile and applying dropout in the network
(especially in the layer right before the L2 loss) is not a great idea.</li>
</ol>

<blockquote>
<p>
When faced with a regression task, first consider if it is absolutely necessary.
Instead, have a strong preference to discretizing your outputs to bins and
perform classification over them whenever possible.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-orgc509fbe" class="outline-4">
<h4 id="orgc509fbe"><span class="section-number-4">4.6.4.</span> Structured prediction</h4>
<div class="outline-text-4" id="text-4-6-4">
<p>
The basic idea behind the structured SVM loss is to demand a margin
 between the correct structure \(y_i\) and the highest-scoring incorrect structure.
</p>
</div>
</div>
</div>


<div id="outline-container-orga87bfdb" class="outline-3">
<h3 id="orga87bfdb"><span class="section-number-3">4.7.</span> Summary</h3>
<div class="outline-text-3" id="text-4-7">
<ol class="org-ol">
<li>The recommended preprocessing is to center the data to have mean of zero,
and normalize its scale to [-1, 1] along each feature.</li>

<li>Initialize the weights by drawing them from a gaussian distribution
with standard deviation of \(\sqrt{2/n}\), where \(n\) is the number of inputs to the neuron.
E.g. in numpy: <code>w = np.random.randn(n) * sqrt(2.0/n)</code>.</li>

<li>Use L2 regularization and dropout (the inverted version).</li>

<li>Use batch normalization.</li>
</ol>
</div>
</div>


<div id="outline-container-org21515e7" class="outline-3">
<h3 id="org21515e7"><span class="section-number-3">4.8.</span> Gradient check</h3>
<div class="outline-text-3" id="text-4-8">
<p>
\[\frac{df(x)}{dx} = \frac{f(x + h) - f(x - h)}{2h}\]
</p>

<p>
\[\frac{\mid f'_a - f'_n \mid}{\max(\mid f'_a \mid, \mid f'_n \mid)}\]
</p>

<p>
<a href="http://docs.oracle.com/cd/E19957-01/806-3568/ncg_goldberg.html">“What Every Computer Scientist Should Know About Floating-Point Arithmetic”</a>
</p>


<p>
<b>Kinks</b> refer to non-differentiable parts of an objective function.
</p>

<p>
It is best to use a short burn-in time during which the network is allowed to
 learn and perform the gradient check after the loss starts to go down.
</p>

<p>
It is recommended to turn off regularization and check the data loss alone first,
 and then the regularization term second and independently.
</p>

<p>
Remember to turn off any non-deterministic effects in the network,
 such as dropout, random data augmentations, etc.
</p>
</div>
</div>


<div id="outline-container-orgdc02ce4" class="outline-3">
<h3 id="orgdc02ce4"><span class="section-number-3">4.9.</span> Ratio of weights:updates</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">assume parameter vector W and its gradient vector dW</span>
<span style="color: #BA36A5;">param_scale</span> = np.linalg.norm(W.ravel())
<span style="color: #BA36A5;">update</span> = -learning_rate*dW <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">simple SGD update</span>
<span style="color: #BA36A5;">update_scale</span> = np.linalg.norm(update.ravel())
<span style="color: #BA36A5;">W</span> += update <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">the actual update</span>
<span style="color: #006FE0;">print</span> update_scale / param_scale <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">want ~1e-3</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org26dc771" class="outline-3">
<h3 id="org26dc771"><span class="section-number-3">4.10.</span> Parameter updates</h3>
<div class="outline-text-3" id="text-4-10">
</div>
<div id="outline-container-org158463c" class="outline-4">
<h4 id="org158463c"><span class="section-number-4">4.10.1.</span> Momentum update</h4>
<div class="outline-text-4" id="text-4-10-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">v</span> = mu * v - learning_rate * dx <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">integrate velocity</span>
<span style="color: #BA36A5;">x</span> += v <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">integrate position</span>
</pre>
</div>

<p>
A typical setting is to start with momentum of about 0.5 and
 anneal it to 0.99 or so over multiple epochs.
</p>
</div>
</div>
