231n.org
*** Nesterov’s Accelerated Momentum (NAG)

#+BEGIN_SRC python
x_ahead = x + mu * v
# evaluate dx_ahead (the gradient at x_ahead instead of at x)
v = mu * v - learning_rate * dx_ahead
x += v
#+END_SRC

Expressing the update in terms of x_ahead instead of x:

#+BEGIN_SRC python
v_prev = v # back this up
v = mu * v - learning_rate * dx # velocity update stays the same
x += -mu * v_prev + (1 + mu) * v # position update changes form
#+END_SRC


*** Annealing the learning rate

1. Step decay.
2. *Exponential decay*. has the mathematical form $\alpha = \alpha_0 e^{-k t}$,
 where $t$ is the iteration number/units of epochs.
3. *1/t decay* has the mathematical form $\alpha = \alpha_0 / (1 + k t)$.


*** Second order methods

Based on Newton’s method:

\[x \leftarrow x - [H f(x)]^{-1} \nabla f(x)\]

Here, $H f(x)$ is the Hessian matrix, which is a square matrix
 of second-order partial derivatives of the function.
The term $\nabla f(x)$ is the gradient vector, as seen in Gradient Descent.

[[http://en.wikipedia.org/wiki/Limited-memory_BFGS][L-BFGS]] uses the information in the gradients over time
 to form the approximation implicitly.
However it must be computed over the entire training set.

[[http://arxiv.org/abs/1311.2115][SFO]] algorithm strives to combine the advantages of SGD with advantages of L-BFGS.


*** Per-parameter adaptive learning rate methods


**** Adagrad

originally proposed by [[http://jmlr.org/papers/v12/duchi11a.html][Duchi et al.]].

#+BEGIN_SRC python
# Assume the gradient dx and parameter vector x
cache += dx**2
x += - learning_rate * dx / (np.sqrt(cache) + eps)
#+END_SRC

A downside of Adagrad is that in case of Deep Learning,
 the monotonic learning rate usually proves too aggressive and stops learning too early.


**** RMSprop

[[http://www.cs.toronto.edu/~tijmen/csc321/slides/lecture_slides_lec6.pdf][Slide 29 of Lecture 6]] of Geoff Hinton’s Coursera class.

#+BEGIN_SRC python
cache = decay_rate * cache + (1 - decay_rate) * dx**2
x += - learning_rate * dx / (np.sqrt(cache) + eps)
#+END_SRC

Here, ~decay_rate~ is a hyperparameter and typical values are [0.9, 0.99, 0.999].


**** [[http://arxiv.org/abs/1412.6980][Adam]]

A recently proposed update that looks a bit like RMSProp with momentum.
 The simplified update looks as follows:

#+BEGIN_SRC python
m = beta1*m + (1-beta1)*dx
v = beta2*v + (1-beta2)*(dx**2)
x += - learning_rate * m / (np.sqrt(v) + eps)
#+END_SRC

Recommended values in the paper are eps = 1e-8, beta1 = 0.9, beta2 = 0.999.

In practice Adam is currently *recommended as the default algorithm* to use,
 and often works slightly better than RMSProp.

However, it is often also worth trying /SGD+Nesterov Momentum/ as an alternative.

The full Adam update also includes a /bias correction/ mechanism.


** Hyperparameter optimization

Prefer one validation fold to cross-validation.

Search for hyperparameters on log scale.

Prefer random search to grid search.

Bayesian Hyperparameter Optimization: [[https://github.com/JasperSnoek/spearmint][Spearmint]], [[http://www.cs.ubc.ca/labs/beta/Projects/SMAC/][SMAC]], and [[http://jaberg.github.io/hyperopt/][Hyperopt]].
However, in practical settings with ConvNets it is still relatively
 difficult to beat random search in a carefully-chosen intervals.


** Model Ensembles

1. Same model, different initializations.
2. Top models discovered during cross-validation.
3. Different checkpoints of a single model.
  Taking different checkpoints of a single network over time
  (for example after every epoch).
  This works reasonably well in practice and is very cheap.
4. Running average of parameters during training.
  Maintain a second copy of the network’s weights in memory that
  maintains an exponentially decaying sum of previous weights during training.
  A cheap way of almost always getting an extra percent or two of performance.

Geoff Hinton on [[https://www.youtube.com/watch?v=EK61htlw8hY][“Dark Knowledge”]].

ref:
[[http://research.microsoft.com/pubs/192769/tricks-2012.pdf][SGD tips and tricks]] from Leon Bottou
[[http://yann.lecun.com/exdb/publis/pdf/lecun-98b.pdf][Efficient BackProp]] (pdf) from Yann LeCun
[[http://yann.lecun.com/exdb/publis/pdf/lecun-98b.pdf][Practical Recommendations for Gradient-Based Training of Deep Architectures]] from Yoshua Bengio


* Convolutional Networks

**  The Conv Layer

\[(W - F + 2P)/S + 1\]

- $W$: input volume size
- $F$: the receptive field size of the Conv Layer neurons
- $S$: the stride with which they are applied
- $P$: the amount of zero padding used

Notice that if all neurons in a single depth slice are using the same weight vector,
 then the forward pass of the CONV layer can in each depth slice be computed as a
 convolution of the neuron’s weights with the input volume (Hence the name: Convolutional Layer).

To summarize:

- input volume size: $W_1 \times W_1 \times D_1$
- parameters:
  - Number of filters $K$
  - their spatial extent $F$
  - the stride $S$
  - the amount of zero padding $P$
- output volume size: $W_2 \times W_2 \times D_2$:
  - $W_2 = (W_1 - F + 2P)/S + 1$
  - $D_2 = K$

The backward pass for a convolution operation (for both the data and the weights)
 is also a convolution (but with spatially-flipped filters).

[[https://arxiv.org/abs/1511.07122][Dilated convolutions]].


