231n.html


<div id="outline-container-org817ac65" class="outline-4">
<h4 id="org817ac65"><span class="section-number-4">4.10.2.</span> Nesterov’s Accelerated Momentum (NAG)</h4>
<div class="outline-text-4" id="text-4-10-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">x_ahead</span> = x + mu * v
<span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">evaluate dx_ahead (the gradient at x_ahead instead of at x)</span>
<span style="color: #BA36A5;">v</span> = mu * v - learning_rate * dx_ahead
<span style="color: #BA36A5;">x</span> += v
</pre>
</div>

<p>
Expressing the update in terms of x_ahead instead of x:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">v_prev</span> = v <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">back this up</span>
<span style="color: #BA36A5;">v</span> = mu * v - learning_rate * dx <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">velocity update stays the same</span>
<span style="color: #BA36A5;">x</span> += -mu * v_prev + (1 + mu) * v <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">position update changes form</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org1a5ba35" class="outline-4">
<h4 id="org1a5ba35"><span class="section-number-4">4.10.3.</span> Annealing the learning rate</h4>
<div class="outline-text-4" id="text-4-10-3">
<ol class="org-ol">
<li>Step decay.</li>
<li><b>Exponential decay</b>. has the mathematical form \(\alpha = \alpha_0 e^{-k t}\),
where \(t\) is the iteration number/units of epochs.</li>
<li><b>1/t decay</b> has the mathematical form \(\alpha = \alpha_0 / (1 + k t)\).</li>
</ol>
</div>
</div>


<div id="outline-container-orgc5a74b2" class="outline-4">
<h4 id="orgc5a74b2"><span class="section-number-4">4.10.4.</span> Second order methods</h4>
<div class="outline-text-4" id="text-4-10-4">
<p>
Based on Newton’s method:
</p>

<p>
\[x \leftarrow x - [H f(x)]^{-1} \nabla f(x)\]
</p>

<p>
Here, \(H f(x)\) is the Hessian matrix, which is a square matrix
 of second-order partial derivatives of the function.
The term \(\nabla f(x)\) is the gradient vector, as seen in Gradient Descent.
</p>

<p>
<a href="http://en.wikipedia.org/wiki/Limited-memory_BFGS">L-BFGS</a> uses the information in the gradients over time
 to form the approximation implicitly.
However it must be computed over the entire training set.
</p>

<p>
<a href="http://arxiv.org/abs/1311.2115">SFO</a> algorithm strives to combine the advantages of SGD with advantages of L-BFGS.
</p>
</div>
</div>


<div id="outline-container-org7f669b7" class="outline-4">
<h4 id="org7f669b7"><span class="section-number-4">4.10.5.</span> Per-parameter adaptive learning rate methods</h4>
<div class="outline-text-4" id="text-4-10-5">
</div>
<div id="outline-container-org6dfcad0" class="outline-5">
<h5 id="org6dfcad0">Adagrad</h5>
<div class="outline-text-5" id="text-org6dfcad0">
<p>
originally proposed by <a href="http://jmlr.org/papers/v12/duchi11a.html">Duchi et al.</a>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">Assume the gradient dx and parameter vector x</span>
<span style="color: #BA36A5;">cache</span> += dx**2
<span style="color: #BA36A5;">x</span> += - learning_rate * dx / (np.sqrt(cache) + eps)
</pre>
</div>

<p>
A downside of Adagrad is that in case of Deep Learning,
 the monotonic learning rate usually proves too aggressive and stops learning too early.
</p>
</div>
</div>


<div id="outline-container-org984a23f" class="outline-5">
<h5 id="org984a23f">RMSprop</h5>
<div class="outline-text-5" id="text-org984a23f">
<p>
<a href="http://www.cs.toronto.edu/~tijmen/csc321/slides/lecture_slides_lec6.pdf">Slide 29 of Lecture 6</a> of Geoff Hinton’s Coursera class.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">cache</span> = decay_rate * cache + (1 - decay_rate) * dx**2
<span style="color: #BA36A5;">x</span> += - learning_rate * dx / (np.sqrt(cache) + eps)
</pre>
</div>

<p>
Here, <code>decay_rate</code> is a hyperparameter and typical values are [0.9, 0.99, 0.999].
</p>
</div>
</div>


<div id="outline-container-org45b0dc4" class="outline-5">
<h5 id="org45b0dc4"><a href="http://arxiv.org/abs/1412.6980">Adam</a></h5>
<div class="outline-text-5" id="text-org45b0dc4">
<p>
A recently proposed update that looks a bit like RMSProp with momentum.
 The simplified update looks as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">m</span> = beta1*m + (1-beta1)*dx
<span style="color: #BA36A5;">v</span> = beta2*v + (1-beta2)*(dx**2)
<span style="color: #BA36A5;">x</span> += - learning_rate * m / (np.sqrt(v) + eps)
</pre>
</div>

<p>
Recommended values in the paper are eps = 1e-8, beta1 = 0.9, beta2 = 0.999.
</p>

<p>
In practice Adam is currently <b>recommended as the default algorithm</b> to use,
 and often works slightly better than RMSProp.
</p>

<p>
However, it is often also worth trying <i>SGD+Nesterov Momentum</i> as an alternative.
</p>

<p>
The full Adam update also includes a <i>bias correction</i> mechanism.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org62d164c" class="outline-3">
<h3 id="org62d164c"><span class="section-number-3">4.11.</span> Hyperparameter optimization</h3>
<div class="outline-text-3" id="text-4-11">
<p>
Prefer one validation fold to cross-validation.
</p>

<p>
Search for hyperparameters on log scale.
</p>

<p>
Prefer random search to grid search.
</p>

<p>
Bayesian Hyperparameter Optimization: <a href="https://github.com/JasperSnoek/spearmint">Spearmint</a>, <a href="http://www.cs.ubc.ca/labs/beta/Projects/SMAC/">SMAC</a>, and <a href="http://jaberg.github.io/hyperopt/">Hyperopt</a>.
However, in practical settings with ConvNets it is still relatively
 difficult to beat random search in a carefully-chosen intervals.
</p>
</div>
</div>


<div id="outline-container-orge5293a9" class="outline-3">
<h3 id="orge5293a9"><span class="section-number-3">4.12.</span> Model Ensembles</h3>
<div class="outline-text-3" id="text-4-12">
<ol class="org-ol">
<li>Same model, different initializations.</li>
<li>Top models discovered during cross-validation.</li>
<li>Different checkpoints of a single model.
Taking different checkpoints of a single network over time
(for example after every epoch).
This works reasonably well in practice and is very cheap.</li>
<li>Running average of parameters during training.
Maintain a second copy of the network’s weights in memory that
maintains an exponentially decaying sum of previous weights during training.
A cheap way of almost always getting an extra percent or two of performance.</li>
</ol>

<p>
Geoff Hinton on <a href="https://www.youtube.com/watch?v=EK61htlw8hY">“Dark Knowledge”</a>.
</p>

<p>
ref:
<a href="http://research.microsoft.com/pubs/192769/tricks-2012.pdf">SGD tips and tricks</a> from Leon Bottou
<a href="http://yann.lecun.com/exdb/publis/pdf/lecun-98b.pdf">Efficient BackProp</a> (pdf) from Yann LeCun
<a href="http://yann.lecun.com/exdb/publis/pdf/lecun-98b.pdf">Practical Recommendations for Gradient-Based Training of Deep Architectures</a> from Yoshua Bengio
</p>
</div>
</div>
</div>


<div id="outline-container-org8fbbd19" class="outline-2">
<h2 id="org8fbbd19"><span class="section-number-2">5.</span> Convolutional Networks</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org24bdf97" class="outline-3">
<h3 id="org24bdf97"><span class="section-number-3">5.1.</span> The Conv Layer</h3>
<div class="outline-text-3" id="text-5-1">
<p>
\[(W - F + 2P)/S + 1\]
</p>

<ul class="org-ul">
<li>\(W\): input volume size</li>
<li>\(F\): the receptive field size of the Conv Layer neurons</li>
<li>\(S\): the stride with which they are applied</li>
<li>\(P\): the amount of zero padding used</li>
</ul>

<p>
Notice that if all neurons in a single depth slice are using the same weight vector,
 then the forward pass of the CONV layer can in each depth slice be computed as a
 convolution of the neuron’s weights with the input volume (Hence the name: Convolutional Layer).
</p>

<p>
To summarize:
</p>

<ul class="org-ul">
<li>input volume size: \(W_1 \times W_1 \times D_1\)</li>
<li>parameters:
<ul class="org-ul">
<li>Number of filters \(K\)</li>
<li>their spatial extent \(F\)</li>
<li>the stride \(S\)</li>
<li>the amount of zero padding \(P\)</li>
</ul></li>
<li>output volume size: \(W_2 \times W_2 \times D_2\):
<ul class="org-ul">
<li>\(W_2 = (W_1 - F + 2P)/S + 1\)</li>
<li>\(D_2 = K\)</li>
</ul></li>
</ul>

<p>
The backward pass for a convolution operation (for both the data and the weights)
 is also a convolution (but with spatially-flipped filters).
</p>

<p>
<a href="https://arxiv.org/abs/1511.07122">Dilated convolutions</a>.
</p>
</div>
</div>
