231n.org
** The Pooling Layer

- input volume size: $W_1 \times W_1 \times D_1$
- parameters:
  - their spatial extent $F$
  - the stride $S$
- output volume size: $W_2 \times W_2 \times D_2$:
  - $W_2 = (W_1 - F)/S + 1$
  - $D_2 = D_1$

Average pooling was often used historically but has recently fallen out of favor
 compared to the max pooling operation, which has been shown to work better in practice.

The backward pass for a max(x, y) operation has a simple interpretation
 as only routing the gradient to the input that had the highest value in the forward pass.
 Hence, during the forward pass of a pooling layer it is common to keep track of
 the index of the max activation (sometimes also called the switches).

*Getting rid of pooling*: [[http://arxiv.org/abs/1412.6806][Striving for Simplicity: The All Convolutional Net]].
 To reduce the size of the representation they suggest using larger stride in CONV layer once in a while.
 Discarding pooling layers has also been found to be important in training good generative models,
 such as variational autoencoders (VAEs) or generative adversarial networks (GANs).
 It seems likely that future architectures will feature very few to no pooling layers.


** Normalization Layer

Normalization layers have since fallen out of favor because
 in practice their contribution has been shown to be minimal, if any.

For various types of normalizations, see the discussion in [[http://code.google.com/p/cuda-convnet/wiki/LayerParams#Local_response_normalization_layer_(same_map)][cuda-convnet library API]].


** FC->CONV conversion

The ability to convert an FC layer to a CONV layer is particularly useful in practice.
It turns out that this conversion allows us to “slide” the original ConvNet
 very efficiently across many spatial positions in a larger image, *in a single forward pass*.

It is common to resize an image to make it bigger, use a converted ConvNet
 to evaluate the class scores at many spatial positions and then average the class scores.


** ConvNet Architectures

~INPUT -> [[CONV -> RELU]*N -> POOL?]*M -> [FC -> RELU]*K -> FC~

Usually N <= 3 and K < 3.

Common ConvNet architectures:

- ~INPUT -> FC~, implements a linear classifier.
- ~INPUT -> CONV -> RELU -> FC~.
- ~INPUT -> [CONV -> RELU -> POOL]*2 -> FC -> RELU -> FC~.
- ~INPUT -> [CONV -> RELU -> CONV -> RELU -> POOL]*3 -> [FC -> RELU]*2 -> FC~.

Multiple stacked CONV layers can develop more complex features
 of the input volume before the destructive pooling operation.

Stacking CONV layers with tiny filters as opposed to having one CONV layer with big filters
 allows us to express more powerful features of the input, and with fewer parameters.

As a practical disadvantage, we might need more memory to hold all the intermediate
 CONV layer results if we plan to do backpropagation.


** Layer Sizing Patterns

The input layer (that contains the image) should be divisible by 2 many times.
 Common numbers include 32 (e.g. CIFAR-10), 64, 96 (e.g. STL-10), or 224 (e.g. common ImageNet ConvNets), 384, and 512.

The conv layers should be using small filters (e.g. 3x3 or at most 5x5),
 using a stride of $S=1$, and *crucially*, zero-pad.

It is only common to see bigger filter sizes (such as 7x7 or so) on the
 very first conv layer that is looking at the input image.

The most common setting for pooling layer is to use max-pooling
 with 2x2 receptive fields, and with a stride of 2.
 Another slightly less common setting is to use 3x3 receptive fields with a stride of 2.


** Case studies

[[http://yann.lecun.com/exdb/publis/pdf/lecun-98.pdf][LeNet]]. The first successful applications of ConvNet.

[[http://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks][AlexNet]]. The first work that popularized ConvNet. Winner of ILSVRC challenge in 2012.
Featured Convolutional Layers *stacked* on top of each other.

[[http://arxiv.org/abs/1311.2901][ZFNet]]. The ILSVRC 2013 winner.

[[http://arxiv.org/abs/1409.4842][GoogLeNet]]. The ILSVRC 2014 winner.
 *Inception Module* that dramatically reduced the number of parameters in the network.
 *Average Pooling* instead of Fully Connected layers at the top of the ConvNet,
 eliminating a large amount of parameters.
 most recently [[http://arxiv.org/abs/1602.07261][Inception-v4]].

[[http://www.robots.ox.ac.uk/~vgg/research/very_deep/][VGGNet]]. Its main contribution was in showing that the depth of the network
 is a critical component for good performance.
 Their final best network contains *16 CONV/FC layers that only performs 3x3 convolutions and 2x2 pooling*.
 Their [[http://www.robots.ox.ac.uk/~vgg/research/very_deep/][pretrained model]] is available for plug and play use in Caffe.

[[http://arxiv.org/abs/1512.03385][ResNet]]. *State of the art* as of May 10, 2016. The winner of ILSVRC 2015.
 It features special skip connections and a heavy use of [[http://arxiv.org/abs/1502.03167][batch normalization]]. 
 Kaiming’s presentation ([[https://www.youtube.com/watch?v=1PGLj-uKT1w][video]], [[http://research.microsoft.com/en-us/um/people/kahe/ilsvrc15/ilsvrc2015_deep_residual_learning_kaiminghe.pdf][slides]]), and [[https://github.com/gcr/torch-residual-networks][reproduced in Torch]].
 Also Kaiming He et al. [[https://arxiv.org/abs/1603.05027][Identity Mappings in Deep Residual Networks]] (published March 2016).

[[https://github.com/soumith/convnet-benchmarks][Soumith benchmarks for CONV performance]].
