231n.html


<div id="outline-container-org562640b" class="outline-3">
<h3 id="org562640b"><span class="section-number-3">5.2.</span> The Pooling Layer</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>input volume size: \(W_1 \times W_1 \times D_1\)</li>
<li>parameters:
<ul class="org-ul">
<li>their spatial extent \(F\)</li>
<li>the stride \(S\)</li>
</ul></li>
<li>output volume size: \(W_2 \times W_2 \times D_2\):
<ul class="org-ul">
<li>\(W_2 = (W_1 - F)/S + 1\)</li>
<li>\(D_2 = D_1\)</li>
</ul></li>
</ul>

<p>
Average pooling was often used historically but has recently fallen out of favor
 compared to the max pooling operation, which has been shown to work better in practice.
</p>

<p>
The backward pass for a max(x, y) operation has a simple interpretation
 as only routing the gradient to the input that had the highest value in the forward pass.
 Hence, during the forward pass of a pooling layer it is common to keep track of
 the index of the max activation (sometimes also called the switches).
</p>

<p>
<b>Getting rid of pooling</b>: <a href="http://arxiv.org/abs/1412.6806">Striving for Simplicity: The All Convolutional Net</a>.
 To reduce the size of the representation they suggest using larger stride in CONV layer once in a while.
 Discarding pooling layers has also been found to be important in training good generative models,
 such as variational autoencoders (VAEs) or generative adversarial networks (GANs).
 It seems likely that future architectures will feature very few to no pooling layers.
</p>
</div>
</div>


<div id="outline-container-orge0aa1b5" class="outline-3">
<h3 id="orge0aa1b5"><span class="section-number-3">5.3.</span> Normalization Layer</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Normalization layers have since fallen out of favor because
 in practice their contribution has been shown to be minimal, if any.
</p>

<p>
For various types of normalizations, see the discussion in <a href="http://code.google.com/p/cuda-convnet/wiki/LayerParams#Local_response_normalization_layer_(same_map)">cuda-convnet library API</a>.
</p>
</div>
</div>


<div id="outline-container-orgd78c819" class="outline-3">
<h3 id="orgd78c819"><span class="section-number-3">5.4.</span> FC-&gt;CONV conversion</h3>
<div class="outline-text-3" id="text-5-4">
<p>
The ability to convert an FC layer to a CONV layer is particularly useful in practice.
It turns out that this conversion allows us to “slide” the original ConvNet
 very efficiently across many spatial positions in a larger image, <b>in a single forward pass</b>.
</p>

<p>
It is common to resize an image to make it bigger, use a converted ConvNet
 to evaluate the class scores at many spatial positions and then average the class scores.
</p>
</div>
</div>


<div id="outline-container-org0006203" class="outline-3">
<h3 id="org0006203"><span class="section-number-3">5.5.</span> ConvNet Architectures</h3>
<div class="outline-text-3" id="text-5-5">
<p>
<code>INPUT -&gt; [[CONV -&gt; RELU]*N -&gt; POOL?]*M -&gt; [FC -&gt; RELU]*K -&gt; FC</code>
</p>

<p>
Usually N &lt;= 3 and K &lt; 3.
</p>

<p>
Common ConvNet architectures:
</p>

<ul class="org-ul">
<li><code>INPUT -&gt; FC</code>, implements a linear classifier.</li>
<li><code>INPUT -&gt; CONV -&gt; RELU -&gt; FC</code>.</li>
<li><code>INPUT -&gt; [CONV -&gt; RELU -&gt; POOL]*2 -&gt; FC -&gt; RELU -&gt; FC</code>.</li>
<li><code>INPUT -&gt; [CONV -&gt; RELU -&gt; CONV -&gt; RELU -&gt; POOL]*3 -&gt; [FC -&gt; RELU]*2 -&gt; FC</code>.</li>
</ul>

<p>
Multiple stacked CONV layers can develop more complex features
 of the input volume before the destructive pooling operation.
</p>

<p>
Stacking CONV layers with tiny filters as opposed to having one CONV layer with big filters
 allows us to express more powerful features of the input, and with fewer parameters.
</p>

<p>
As a practical disadvantage, we might need more memory to hold all the intermediate
 CONV layer results if we plan to do backpropagation.
</p>
</div>
</div>


<div id="outline-container-org9e47bba" class="outline-3">
<h3 id="org9e47bba"><span class="section-number-3">5.6.</span> Layer Sizing Patterns</h3>
<div class="outline-text-3" id="text-5-6">
<p>
The input layer (that contains the image) should be divisible by 2 many times.
 Common numbers include 32 (e.g. CIFAR-10), 64, 96 (e.g. STL-10), or 224 (e.g. common ImageNet ConvNets), 384, and 512.
</p>

<p>
The conv layers should be using small filters (e.g. 3x3 or at most 5x5),
 using a stride of \(S=1\), and <b>crucially</b>, zero-pad.
</p>

<p>
It is only common to see bigger filter sizes (such as 7x7 or so) on the
 very first conv layer that is looking at the input image.
</p>

<p>
The most common setting for pooling layer is to use max-pooling
 with 2x2 receptive fields, and with a stride of 2.
 Another slightly less common setting is to use 3x3 receptive fields with a stride of 2.
</p>
</div>
</div>


<div id="outline-container-org8110b4c" class="outline-3">
<h3 id="org8110b4c"><span class="section-number-3">5.7.</span> Case studies</h3>
<div class="outline-text-3" id="text-5-7">
<p>
<a href="http://yann.lecun.com/exdb/publis/pdf/lecun-98.pdf">LeNet</a>. The first successful applications of ConvNet.
</p>

<p>
<a href="http://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks">AlexNet</a>. The first work that popularized ConvNet. Winner of ILSVRC challenge in 2012.
Featured Convolutional Layers <b>stacked</b> on top of each other.
</p>

<p>
<a href="http://arxiv.org/abs/1311.2901">ZFNet</a>. The ILSVRC 2013 winner.
</p>

<p>
<a href="http://arxiv.org/abs/1409.4842">GoogLeNet</a>. The ILSVRC 2014 winner.
 <b>Inception Module</b> that dramatically reduced the number of parameters in the network.
 <b>Average Pooling</b> instead of Fully Connected layers at the top of the ConvNet,
 eliminating a large amount of parameters.
 most recently <a href="http://arxiv.org/abs/1602.07261">Inception-v4</a>.
</p>

<p>
<a href="http://www.robots.ox.ac.uk/~vgg/research/very_deep/">VGGNet</a>. Its main contribution was in showing that the depth of the network
 is a critical component for good performance.
 Their final best network contains <b>16 CONV/FC layers that only performs 3x3 convolutions and 2x2 pooling</b>.
 Their <a href="http://www.robots.ox.ac.uk/~vgg/research/very_deep/">pretrained model</a> is available for plug and play use in Caffe.
</p>

<p>
<a href="http://arxiv.org/abs/1512.03385">ResNet</a>. <b>State of the art</b> as of May 10, 2016. The winner of ILSVRC 2015.
 It features special skip connections and a heavy use of <a href="http://arxiv.org/abs/1502.03167">batch normalization</a>. 
 Kaiming’s presentation (<a href="https://www.youtube.com/watch?v=1PGLj-uKT1w">video</a>, <a href="http://research.microsoft.com/en-us/um/people/kahe/ilsvrc15/ilsvrc2015_deep_residual_learning_kaiminghe.pdf">slides</a>), and <a href="https://github.com/gcr/torch-residual-networks">reproduced in Torch</a>.
 Also Kaiming He et al. <a href="https://arxiv.org/abs/1603.05027">Identity Mappings in Deep Residual Networks</a> (published March 2016).
</p>

<p>
<a href="https://github.com/soumith/convnet-benchmarks">Soumith benchmarks for CONV performance</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scturtle</p>
<p class="date">Created: 2023-06-14 Wed 18:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>